### **Task:**  
**Create a pivot table** that shows the total spending per customer for each product category (e.g., Electronics, Accessories). Display `CustomerName` and separate columns for each product category with the total spending.

---

### **Dataset:**

We'll use the same dataset I provided earlier:

```sql
-- Customers Table
CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(100),
    City VARCHAR(100),
    SignupDate DATE
);

-- Products Table
CREATE TABLE Products (
    ProductID INT PRIMARY KEY,
    ProductName VARCHAR(100),
    Category VARCHAR(100)
);

-- Purchases Table
CREATE TABLE Purchases (
    PurchaseID INT PRIMARY KEY,
    CustomerID INT,
    ProductID INT,
    Quantity INT,
    Price DECIMAL(10, 2),
    PurchaseDate DATE,
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);

-- Sample data insertion
-- Use the same data I provided earlier for customers, products, and purchases.
```

### **Steps:**
1. **Join the tables** `Customers`, `Products`, and `Purchases`.
2. **Group by** `CustomerName` and `Product Category`.
3. **Pivot** the results so that each `Product Category` becomes a column showing the total spending for that category.

#### Create a pivot table that shows the total spending per customer for each product category (e.g., Electronics, Accessories). Display CustomerName and separate columns for each product category with the total spending.

In [1]:
%load_ext sql

In [10]:
%sql mysql+pymysql://root:password@localhost:3306/sales

'Connected: root@sales'

In [25]:
%%sql
SELECT CustomerName, ProductName, (Price * Quantity) Total FROM
Customers c
JOIN Purchases p
ON c.CustomerID = p.CustomerID
JOIN Products pr
ON pr.ProductID = p.ProductID

 * mysql+pymysql://root:***@localhost:3306/sales
10 rows affected.

[('John Doe', 'Laptop', Decimal('2000.00')),
 ('John Doe', 'Smartphone', Decimal('600.00')),
 ('John Doe', 'Headphones', Decimal('250.00')),
 ('Jane Smith', 'Monitor', Decimal('250.00')),
 ('Jane Smith', 'Smartphone', Decimal('600.00')),
 ('Michael Lee', 'Laptop', Decimal('1000.00')),
 ('Michael Lee', 'Headphones', Decimal('150.00')),
 ('Anna Green', 'Keyboard', Decimal('140.00')),
 ('David Brown', 'Smartphone', Decimal('1800.00')),
 ('David Brown', 'Monitor', Decimal('250.00'))]

In [35]:
%%sql
WITH total_purchase AS(
SELECT CustomerName, ProductName, (Price * Quantity) Total FROM
Customers c
JOIN Purchases p
ON c.CustomerID = p.CustomerID
JOIN Products pr
ON pr.ProductID = p.ProductID)

SELECT 
    CustomerName,
    SUM(CASE WHEN ProductName = "Laptop" THEN Total ELSE 0 END) "Laptop",
    SUM(CASE WHEN ProductName = "Smartphone" THEN Total ELSE 0 END) "Smartphone",
    SUM(CASE WHEN ProductName = "Headphones" THEN Total ELSE 0 END) "Headphones",
    SUM(CASE WHEN ProductName = "Monitor" THEN Total ELSE 0 END) "Monitor",
    SUM(CASE WHEN ProductName = "Keyboard" THEN Total ELSE 0 END) "Keyboard"

FROM total_purchase
GROUP BY CustomerName;

 * mysql+pymysql://root:***@localhost:3306/sales
5 rows affected.

[('John Doe', Decimal('2000.00'), Decimal('600.00'), Decimal('250.00'), Decimal('0.00'), Decimal('0.00')),
 ('Jane Smith', Decimal('0.00'), Decimal('600.00'), Decimal('0.00'), Decimal('250.00'), Decimal('0.00')),
 ('Michael Lee', Decimal('1000.00'), Decimal('0.00'), Decimal('150.00'), Decimal('0.00'), Decimal('0.00')),
 ('Anna Green', Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('140.00')),
 ('David Brown', Decimal('0.00'), Decimal('1800.00'), Decimal('0.00'), Decimal('250.00'), Decimal('0.00'))]

In [33]:
%%sql
-- Step 1: Get all distinct products
SET @products = NULL;
SELECT GROUP_CONCAT(DISTINCT CONCAT(
    'SUM(CASE WHEN ProductName = ''', ProductName, ''' THEN Total ELSE 0 END) AS `', ProductName, '`'
)) INTO @products
FROM Products;

-- Step 2: Construct the dynamic SQL query
SET @sql = CONCAT(
    'SELECT CustomerName, ', @products, ' 
     FROM (SELECT c.CustomerName, pr.ProductName, (p.Price * p.Quantity) AS Total 
           FROM Customers c
           JOIN Purchases p ON c.CustomerID = p.CustomerID
           JOIN Products pr ON pr.ProductID = p.ProductID) AS total_purchase 
     GROUP BY CustomerName'
);

-- Step 3: Prepare and execute the query
PREPARE stmt FROM @sql;
EXECUTE stmt;

 * mysql+pymysql://root:***@localhost:3306/sales
0 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
5 rows affected.

[('John Doe', Decimal('250.00'), Decimal('0.00'), Decimal('2000.00'), Decimal('0.00'), Decimal('600.00')),
 ('Jane Smith', Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('250.00'), Decimal('600.00')),
 ('Michael Lee', Decimal('150.00'), Decimal('0.00'), Decimal('1000.00'), Decimal('0.00'), Decimal('0.00')),
 ('Anna Green', Decimal('0.00'), Decimal('140.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00')),
 ('David Brown', Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('250.00'), Decimal('1800.00'))]

In [34]:
%%sql
SELECT CustomerName, ProductName, (Price * Quantity) Total FROM
Customers c
JOIN Purchases p
ON c.CustomerID = p.CustomerID
JOIN Products pr
ON pr.ProductID = p.ProductID

 * mysql+pymysql://root:***@localhost:3306/sales
10 rows affected.

[('John Doe', 'Laptop', Decimal('2000.00')),
 ('John Doe', 'Smartphone', Decimal('600.00')),
 ('John Doe', 'Headphones', Decimal('250.00')),
 ('Jane Smith', 'Monitor', Decimal('250.00')),
 ('Jane Smith', 'Smartphone', Decimal('600.00')),
 ('Michael Lee', 'Laptop', Decimal('1000.00')),
 ('Michael Lee', 'Headphones', Decimal('150.00')),
 ('Anna Green', 'Keyboard', Decimal('140.00')),
 ('David Brown', 'Smartphone', Decimal('1800.00')),
 ('David Brown', 'Monitor', Decimal('250.00'))]

In [ ]:
-- Step 1: Identify all distinct products and generate the necessary columns
SET @products = NULL; -- Initialize a variable to hold all distinct product columns
SELECT GROUP_CONCAT(DISTINCT CONCAT(
    'SUM(CASE WHEN ProductName = ''', ProductName, ''' THEN Total ELSE 0 END) AS `', ProductName, '`'
)) INTO @products -- Use GROUP_CONCAT to dynamically generate CASE statements for each product
FROM Products;

-- Step 2: Construct the dynamic SQL query using the columns generated
SET @sql = CONCAT(
    'SELECT CustomerName, ', @products, ' 
     FROM (SELECT c.CustomerName, pr.ProductName, (p.Price * p.Quantity) AS Total 
           FROM Customers c
           JOIN Purchases p ON c.CustomerID = p.CustomerID
           JOIN Products pr ON pr.ProductID = p.ProductID) AS total_purchase 
     GROUP BY CustomerName'
);

-- Step 3: Prepare and execute the dynamic SQL query
PREPARE stmt FROM @sql; -- Prepare the query string
EXECUTE stmt;           -- Execute the dynamically generated query
DEALLOCATE PREPARE stmt; -- Clean up

In [37]:
%%sql
WITH total_purchase AS(
SELECT CustomerName, ProductName, (Price * Quantity) Total FROM
Customers c
JOIN Purchases p
ON c.CustomerID = p.CustomerID
JOIN Products pr
ON pr.ProductID = p.ProductID)

SELECT 
    CustomerName,
    SUM(CASE WHEN ProductName = "Laptop" THEN Total ELSE 0 END) "Laptop"
FROM total_purchase
GROUP BY CustomerName;

 * mysql+pymysql://root:***@localhost:3306/sales
5 rows affected.

[('John Doe', Decimal('2000.00')),
 ('Jane Smith', Decimal('0.00')),
 ('Michael Lee', Decimal('1000.00')),
 ('Anna Green', Decimal('0.00')),
 ('David Brown', Decimal('0.00'))]

In [57]:
%%sql 
SET @products = NULL;

SELECT 
    GROUP_CONCAT(
        DISTINCT CONCAT(
    'SUM(CASE WHEN ProductName = "',ProductName,'" THEN Total ELSE 0 END) AS "', ProductName, '"'
    )) INTO @products
    FROM Products;

SET @sql = CONCAT(
    'SELECT CustomerName, ', @products, ' 
     FROM (SELECT c.CustomerName, pr.ProductName, (p.Price * p.Quantity) AS Total 
           FROM Customers c
           JOIN Purchases p ON c.CustomerID = p.CustomerID
           JOIN Products pr ON pr.ProductID = p.ProductID) AS total_purchase 
     GROUP BY CustomerName'
);


PREPARE stmt FROM @sql; -- Prepare the query string
EXECUTE stmt;           -- Execute the dynamically generated query

 * mysql+pymysql://root:***@localhost:3306/sales
0 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
5 rows affected.

[('John Doe', Decimal('250.00'), Decimal('0.00'), Decimal('2000.00'), Decimal('0.00'), Decimal('600.00')),
 ('Jane Smith', Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('250.00'), Decimal('600.00')),
 ('Michael Lee', Decimal('150.00'), Decimal('0.00'), Decimal('1000.00'), Decimal('0.00'), Decimal('0.00')),
 ('Anna Green', Decimal('0.00'), Decimal('140.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00')),
 ('David Brown', Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('250.00'), Decimal('1800.00'))]

In [77]:
%%sql
SET @product = NULL;
SELECT GROUP_CONCAT(
    DISTINCT CONCAT(
        'SUM(CASE WHEN ProductName = "',ProductName,'" THEN Total ELSE 0 END) "',ProductName,'"'
    ))INTO @product
    FROM Products;
SET @sql = CONCAT('SELECT CustomerName, ', @product, '
    FROM (SELECT c.CustomerName, pr.ProductName, (p.Price * p.Quantity) AS Total 
           FROM Customers c
           JOIN Purchases p ON c.CustomerID = p.CustomerID
           JOIN Products pr ON pr.ProductID = p.ProductID) AS total_purchase 
     GROUP BY CustomerName'
     );
PREPARE stmt FROM @sql;
EXECUTE stmt;

 * mysql+pymysql://root:***@localhost:3306/sales
0 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
5 rows affected.

[('John Doe', Decimal('250.00'), Decimal('0.00'), Decimal('2000.00'), Decimal('0.00'), Decimal('600.00')),
 ('Jane Smith', Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('250.00'), Decimal('600.00')),
 ('Michael Lee', Decimal('150.00'), Decimal('0.00'), Decimal('1000.00'), Decimal('0.00'), Decimal('0.00')),
 ('Anna Green', Decimal('0.00'), Decimal('140.00'), Decimal('0.00'), Decimal('0.00'), Decimal('0.00')),
 ('David Brown', Decimal('0.00'), Decimal('0.00'), Decimal('0.00'), Decimal('250.00'), Decimal('1800.00'))]